admin-button-back = ⬅️ Назад

admin-menu-text =
    Добро пожаловать в админ-панель бота!

    {$club_price ->
        [no] ⚠️ Не задана цена для Доступ в клуб
        *[other] Цена для Доступ в клуб: { $club_price } ₽
    }
    {$mentor_price ->
        [no] ⚠️ Не задана цена для Доступ + Наставничество
        *[other] Цена для Доступ + Наставничество: { $mentor_price } ₽
    }
    {$mentor_upgrade_price ->
        [no] ⚠️ Не задана цена для Наставничество
        *[other] Цена для Наставничество: { $mentor_upgrade_price } ₽
    }

admin-menu-button-analytics = 📊 Аналитика
admin-menu-button-price = 💵 Задать цену
admin-menu-button-mailing = ✉️ Рассылка
admin-menu-button-user = 👤 Перейти в меню пользователя

admin-menu-price-text = Выберите товар, для которого хотите задать цену
admin-menu-price-button-club = 🤖 Доступ в клуб
admin-menu-price-button-mentor-left = 🤖👨‍🏫 Доступ + Наставничество
admin-menu-price-button-mentor-member = 👨‍🏫 Наставничество
admin-menu-price-set-text = Задайте цену для товара, обязательно укажите копейки после точки! Формат: Р.КК
admin-menu-price-set-finish = Новая цена для { $product }: { $price }