menu-text =
    <b>👋 Привет. Я Валя Нейро, умный бот нейро креатора.</b>

    🔥 Ты заинтересовался(лась) нейросетями, и правильно сделал(а).
    🏆 В ближайшие 5-10 лет Искусственный интеллект будет в топе и специалисты, умеющие работать с ним, будут очень востребованы.
    ❗️ Поэтому залетай в наше клубное сообщество и прокачивай свои навыки.

menu-button-description = 📔 Начать обучение
menu-button-guides = 🆓 Забрать гайды
menu-button-pay = 💳 Оплатить 4990₽

menu-description =
    🤖 Клубное обучение системной работе с нейро генерациями, монтаж вирусных роликов и как заработать на нейронках в 2026 году.
    ‼️ До конца месяца стоимость 4990₽

    💚 Получить доступ НАВСЕГДА ⤵️
