menu-text =
    <b>👋 Привет. Я Валя Нейро, умный бот нейро креатора.</b>

    🔥 Ты заинтересовался(лась) нейросетями, и правильно сделал(а).
    🏆 В ближайшие 5-10 лет Искусственный интеллект будет в топе и специалисты, умеющие работать с ним, будут очень востребованы.
    ❗️ Поэтому залетай в наше клубное сообщество и прокачивай свои навыки.

menu-button-description = 📔 Начать обучение
menu-button-guides = 🆓 Забрать гайды
menu-button-pay-club = 🟢 Получить доступ { $price } ₽
menu-button-pay-mentor = 🆕 Доступ + Наставничество { $price } ₽

menu-description =
    Я собрала простой пошаговый клуб, где ты с нуля начинаешь делать креативы в нейросетях и монетизировать навык.  
    Мои ученики стартовали с нуля и уже берут заказы от 3 000 до 50 000 ₽ за один.

    👉🏻 Внутри клуба ты:
    • научишься создавать нейрофотосессии, карточки товаров, фото‑креативы для брендов (за которые реально платят)
    • научишься делать креативный AI‑видеоконтент для своего блога и для клиентов
    • разберёшь структуру виральных роликов и продающего контента (не «залетело», а система)
    • получишь навыки монтажа и упаковки, чтобы ролики выглядели дорого
    • получишь закрытую базу премиум‑промптов, которые экономят часы тестов
    • доступ к постоянно обновляемой базе знаний
    • для работы нужен только телефон 

    ⚡️ Важно: цена будет расти — по мере роста клуба и уроков.  

    Вариант 1: участие в клубе — { $club_price } ₽  
    Вариант 2: клуб + личное наставничество — { $mentor_price } ₽

    ❗️Для работы нужна отдельная подписка на нейросети (примерно 1690 ₽/мес), она не входит в стоимость клуба.

    🎁 Заходи сейчас, пока действует текущая цена ⬇️


menu-invoice-club-member = 🎉 Поздравляю! Вы уже состоите в клубе.
menu-invoice-club-admin = 🤔 Похоже, вы администратор клуба.
menu-invoice-club-kicked = ☹️ К сожалению, вы были исключены из клуба.
menu-invoice-club-title = Участие в клубе
menu-invoice-club-description = 🤖 Клубное обучение системной работе с нейро генерациями, монтаж вирусных роликов и как заработать на нейронках в 2026 году.

menu-invoice-mentor-member = Так как вы состоите в клубе, цена для вас составит { $price } ₽
menu-invoice-mentor-title = Клуб + Наставничество
menu-invoice-mentor-description = Клубное обучение + Личное наставничество !DEVELOPMENT!

successful-payment-club =
    Ваша <u>одноразовая</u> ссылка-приглашение для доступа в Нейро Старт:
    { $link }
successful-payment-mentor-left =
    Ваша <u>одноразовая</u> ссылка-приглашение для доступа в Нейро Старт:
    { $link }
    !DEVELOPMENT!
successful-payment-mentor-member =
    !DEVELOPMENT!