from decimal import Decimal
from typing import Literal

from fluent_compiler.types import FluentType
from typing_extensions import TypeAlias

PossibleValue: TypeAlias = str | int | float | Decimal | bool | FluentType

class TranslatorRunner:
    def get(self, path: str, **kwargs: PossibleValue) -> str: ...
    menu: Menu
    successful: Successful

class MenuButtonPay:
    @staticmethod
    def club(*, price: PossibleValue) -> Literal["""🟢 Получить доступ { $price } ₽"""]: ...
    @staticmethod
    def mentor(*, price: PossibleValue) -> Literal["""🆕 Доступ + Наставничество { $price } ₽"""]: ...

class MenuButton:
    pay: MenuButtonPay

    @staticmethod
    def description() -> Literal["""📔 Начать обучение"""]: ...
    @staticmethod
    def guides() -> Literal["""🆓 Забрать гайды"""]: ...

class MenuInvoiceClub:
    @staticmethod
    def member() -> Literal["""🎉 Поздравляю! Вы уже состоите в клубе."""]: ...
    @staticmethod
    def admin() -> Literal["""🤔 Похоже, вы администратор клуба."""]: ...
    @staticmethod
    def kicked() -> Literal["""☹️ К сожалению, вы были исключены из клуба."""]: ...
    @staticmethod
    def title() -> Literal["""Участие в клубе"""]: ...
    @staticmethod
    def description() -> Literal["""🤖 Клубное обучение системной работе с нейро генерациями, монтаж вирусных роликов и как заработать на нейронках в 2026 году."""]: ...

class MenuInvoiceMentor:
    @staticmethod
    def member(*, price: PossibleValue) -> Literal["""Так как вы состоите в клубе, цена для вас составит { $price } ₽"""]: ...
    @staticmethod
    def title() -> Literal["""Клуб + Наставничество"""]: ...
    @staticmethod
    def description() -> Literal["""Клубное обучение + Личное наставничество !DEVELOPMENT!"""]: ...

class MenuInvoice:
    club: MenuInvoiceClub
    mentor: MenuInvoiceMentor

class Menu:
    button: MenuButton
    invoice: MenuInvoice

    @staticmethod
    def text() -> Literal["""&lt;b&gt;👋 Привет. Я Валя Нейро, умный бот нейро креатора.&lt;/b&gt;

🔥 Ты заинтересовался(лась) нейросетями, и правильно сделал(а).
🏆 В ближайшие 5-10 лет Искусственный интеллект будет в топе и специалисты, умеющие работать с ним, будут очень востребованы.
❗️ Поэтому залетай в наше клубное сообщество и прокачивай свои навыки."""]: ...
    @staticmethod
    def description(*, club_price: PossibleValue, mentor_price: PossibleValue) -> Literal["""Я собрала простой пошаговый клуб, где ты с нуля начинаешь делать креативы в нейросетях и монетизировать навык.  
Мои ученики стартовали с нуля и уже берут заказы от 3 000 до 50 000 ₽ за один.

👉🏻 Внутри клуба ты:
• научишься создавать нейрофотосессии, карточки товаров, фото‑креативы для брендов (за которые реально платят)
• научишься делать креативный AI‑видеоконтент для своего блога и для клиентов
• разберёшь структуру виральных роликов и продающего контента (не «залетело», а система)
• получишь навыки монтажа и упаковки, чтобы ролики выглядели дорого
• получишь закрытую базу премиум‑промптов, которые экономят часы тестов
• доступ к постоянно обновляемой базе знаний
• для работы нужен только телефон 

⚡️ Важно: цена будет расти — по мере роста клуба и уроков.  

Вариант 1: участие в клубе — { $club_price } ₽  
Вариант 2: клуб + личное наставничество — { $mentor_price } ₽

❗️Для работы нужна отдельная подписка на нейросети (примерно 1690 ₽/мес), она не входит в стоимость клуба.

🎁 Заходи сейчас, пока действует текущая цена ⬇️"""]: ...

class SuccessfulPaymentMentor:
    @staticmethod
    def left(*, link: PossibleValue) -> Literal["""Ваша &lt;u&gt;одноразовая&lt;/u&gt; ссылка-приглашение для доступа в Нейро Старт:
{ $link }
!DEVELOPMENT!"""]: ...
    @staticmethod
    def member() -> Literal["""!DEVELOPMENT!"""]: ...

class SuccessfulPayment:
    mentor: SuccessfulPaymentMentor

    @staticmethod
    def club(*, link: PossibleValue) -> Literal["""Ваша &lt;u&gt;одноразовая&lt;/u&gt; ссылка-приглашение для доступа в Нейро Старт:
{ $link }"""]: ...

class Successful:
    payment: SuccessfulPayment
